{
    "metadata": {
        "type": "global_relations",
        "processing_mode": "section",
        "timestamp": "2025-03-05T16:58:31.230752"
    },
    "articles": {
        "Garden path sentence": {
            "category": "linguistics",
            "relations": [
                {
                    "source": "garden-path sentence",
                    "relation_type": "causes confusion",
                    "target": "ambiguity",
                    "evidence": "Garden-path sentences often lead to initial misinterpretations due to their syntactically non-standard structure, which creates ambiguity in understanding the intended meaning."
                },
                {
                    "source": "reader's interpretation",
                    "relation_type": "influences clarity",
                    "target": "communication clarity",
                    "evidence": "The way a reader interprets a sentence can significantly affect the clarity of communication, as different interpretations can lead to misunderstandings."
                },
                {
                    "source": "psycholinguistic research",
                    "relation_type": "informs understanding",
                    "target": "initial parsing",
                    "evidence": "Psycholinguistic research provides insights into how readers perform initial parsing of sentences, which is crucial for understanding sentence structure and meaning."
                },
                {
                    "source": "initial parsing",
                    "relation_type": "leads to",
                    "target": "re-analysis",
                    "evidence": "When readers encounter garden-path sentences, their initial parsing often requires re-analysis to arrive at the correct interpretation, highlighting the dynamic nature of sentence processing."
                },
                {
                    "source": "semantic sense",
                    "relation_type": "is affected by",
                    "target": "grammatically correct",
                    "evidence": "The semantic sense of a sentence is contingent upon its grammatical correctness; if a sentence is grammatically incorrect, it may lead to confusion regarding its meaning."
                },
                {
                    "source": "frequent pattern",
                    "relation_type": "facilitates",
                    "target": "parallel parsing",
                    "evidence": "Frequent patterns in language can facilitate parallel parsing, allowing readers to process multiple interpretations simultaneously, which can enhance comprehension."
                },
                {
                    "source": "pragmatics",
                    "relation_type": "interacts with",
                    "target": "semantics",
                    "evidence": "Pragmatics and semantics interact closely, as the meaning derived from a sentence (semantics) can be influenced by the context in which it is used (pragmatics), affecting overall understanding."
                },
                {
                    "source": "non-reduced relative clause",
                    "relation_type": "compared to",
                    "target": "reduced relative clause",
                    "evidence": "Non-reduced relative clauses provide more explicit information compared to reduced relative clauses, which can impact the clarity and complexity of sentence interpretation."
                },
                {
                    "source": "agent – action – patient",
                    "relation_type": "framework for",
                    "target": "parsing",
                    "evidence": "The agent – action – patient structure serves as a fundamental framework for parsing sentences, guiding readers in understanding the roles of different components within a sentence."
                },
                {
                    "source": "Fowler's description",
                    "relation_type": "provides insight into",
                    "target": "communication clarity",
                    "evidence": "Fowler's description of language usage emphasizes the importance of clarity in communication, which is essential for effective understanding and interpretation."
                },
                {
                    "source": "serial parsing",
                    "relation_type": "contrasts with",
                    "target": "parallel parsing",
                    "evidence": "Serial parsing processes one interpretation at a time, while parallel parsing allows for multiple interpretations, showcasing different strategies readers use to make sense of complex sentences."
                },
                {
                    "source": "garden-path sentence",
                    "relation_type": "causes confusion",
                    "target": "ambiguity",
                    "evidence": "Garden-path sentences often lead to initial misinterpretations due to their ambiguous structure, requiring readers to re-analyze the sentence to derive the correct meaning."
                },
                {
                    "source": "initial parsing",
                    "relation_type": "influences understanding",
                    "target": "reader's interpretation",
                    "evidence": "The way a reader initially parses a sentence can significantly affect their interpretation, especially in cases of syntactically non-standard constructions."
                },
                {
                    "source": "psycholinguistic research",
                    "relation_type": "supports theories",
                    "target": "sentence processing",
                    "evidence": "Psycholinguistic research provides empirical evidence for how sentence processing occurs, including the mechanisms behind initial parsing and re-analysis."
                },
                {
                    "source": "semantic sense",
                    "relation_type": "interacts with",
                    "target": "pragmatics",
                    "evidence": "Understanding the semantic sense of a sentence is crucial for effective communication, as it interacts with pragmatic elements to clarify meaning."
                },
                {
                    "source": "executive functioning",
                    "relation_type": "affects",
                    "target": "eye movements",
                    "evidence": "Executive functioning plays a role in how individuals control their eye movements during reading, impacting their ability to parse sentences and resolve ambiguities."
                },
                {
                    "source": "competing syntactic representations",
                    "relation_type": "creates challenges in",
                    "target": "initial parsing",
                    "evidence": "When multiple syntactic representations compete for interpretation, it complicates the initial parsing process, leading to potential misinterpretations."
                },
                {
                    "source": "discourse and referential information",
                    "relation_type": "enhances",
                    "target": "communication clarity",
                    "evidence": "Incorporating discourse and referential information helps to clarify communication by providing context that aids in the interpretation of sentences."
                },
                {
                    "source": "l2 learners",
                    "relation_type": "experience difficulties with",
                    "target": "grammatically correct",
                    "evidence": "L2 learners often struggle with understanding grammatically correct sentences due to their reliance on different parsing strategies compared to native speakers."
                },
                {
                    "source": "reduced relative clause",
                    "relation_type": "complicates",
                    "target": "initial parsing",
                    "evidence": "Reduced relative clauses can complicate initial parsing because they often omit elements that are crucial for understanding the sentence structure."
                },
                {
                    "source": "frequent pattern",
                    "relation_type": "facilitates",
                    "target": "sentence processing",
                    "evidence": "Frequent patterns in language can facilitate sentence processing by allowing readers to quickly recognize and interpret familiar structures."
                }
            ]
        }
    }
}